# BritishThermalUnitsPerHourSquareFootDegreeFahrenheit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..BritishThermalUnitsPerHourSquareFootDegreeFahrenheit Property
UnitTypeId Class See Also
---
British thermal units per hour square foot degree Fahrenheit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId BritishThermalUnitsPerHourSquareFootDegreeFahrenheit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BritishThermalUnitsPerHourSquareFootDegreeFahrenheit As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BritishThermalUnitsPerHourSquareFootDegreeFahrenheit {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace